-- MariaDB dump 10.19  Distrib 10.4.32-MariaDB, for Win64 (AMD64)
--
-- Host: localhost    Database: behavior_system
-- ------------------------------------------------------
-- Server version	10.4.32-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `behavior_system`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `behavior_system` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci */;

USE `behavior_system`;

--
-- Table structure for table `appeals`
--

DROP TABLE IF EXISTS `appeals`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `appeals` (
  `AppealID` varchar(36) NOT NULL,
  `RecordID` varchar(36) NOT NULL,
  `StudentID` varchar(10) NOT NULL,
  `Reason` text NOT NULL,
  `EvidencePath` varchar(255) DEFAULT NULL,
  `AppealDate` date NOT NULL,
  `Status` varchar(50) NOT NULL DEFAULT 'รอตรวจสอบ',
  `ReviewerID` varchar(36) DEFAULT NULL,
  `ReviewDate` date DEFAULT NULL,
  `ReviewNotes` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`AppealID`),
  KEY `appeals_recordid_foreign` (`RecordID`),
  KEY `appeals_studentid_foreign` (`StudentID`),
  KEY `appeals_reviewerid_foreign` (`ReviewerID`),
  CONSTRAINT `appeals_recordid_foreign` FOREIGN KEY (`RecordID`) REFERENCES `behavior_records` (`RecordID`) ON DELETE CASCADE,
  CONSTRAINT `appeals_reviewerid_foreign` FOREIGN KEY (`ReviewerID`) REFERENCES `users` (`UserID`) ON DELETE SET NULL,
  CONSTRAINT `appeals_studentid_foreign` FOREIGN KEY (`StudentID`) REFERENCES `students` (`StudentID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `appeals`
--

LOCK TABLES `appeals` WRITE;
/*!40000 ALTER TABLE `appeals` DISABLE KEYS */;
INSERT INTO `appeals` VALUES ('339f07ba-ad70-40fc-beda-7a2fd19b75d2','03ac6bbb-9b72-43dd-a1b2-a29a4f4b1081','10005','ข้าพเจ้าไม่ได้กระทำการดังกล่าว เนื่องจากในวันเกิดเหตุข้าพเจ้าอยู่ที่ห้องสมุดตลอดช่วงเวลานั้น ขอให้ตรวจสอบกล้องวงจรปิดเพื่อยืนยัน',NULL,'2026-06-08','รอตรวจสอบ',NULL,NULL,NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('e41bd5ce-8927-4a38-9c0f-46bb58c8e501','b001e634-4b7e-4d39-8b1f-0ea50b4f5b81','10004','ข้าพเจ้าไม่ได้กระทำการดังกล่าว เนื่องจากในวันเกิดเหตุข้าพเจ้าอยู่ที่ห้องสมุดตลอดช่วงเวลานั้น ขอให้ตรวจสอบกล้องวงจรปิดเพื่อยืนยัน',NULL,'2026-06-25','คืนคะแนน',NULL,NULL,NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43');
/*!40000 ALTER TABLE `appeals` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `attendances`
--

DROP TABLE IF EXISTS `attendances`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `attendances` (
  `AttendanceID` varchar(36) NOT NULL,
  `StudentID` varchar(10) NOT NULL,
  `Date` date NOT NULL,
  `Status` varchar(50) NOT NULL,
  `RecordedBy` varchar(36) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`AttendanceID`),
  KEY `attendances_studentid_foreign` (`StudentID`),
  KEY `attendances_recordedby_foreign` (`RecordedBy`),
  CONSTRAINT `attendances_recordedby_foreign` FOREIGN KEY (`RecordedBy`) REFERENCES `users` (`UserID`) ON DELETE CASCADE,
  CONSTRAINT `attendances_studentid_foreign` FOREIGN KEY (`StudentID`) REFERENCES `students` (`StudentID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `attendances`
--

LOCK TABLES `attendances` WRITE;
/*!40000 ALTER TABLE `attendances` DISABLE KEYS */;
INSERT INTO `attendances` VALUES ('02332859-3b23-4b8b-bb05-d3c0e581480f','10003','2026-06-22','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('0308c421-5e69-4b99-83e0-420f3472226f','10006','2026-06-09','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('06d1a016-c514-431e-9140-7ddbf65f7f3f','10002','2026-06-22','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('07d925fc-9afc-4574-9e94-ef2fd9494556','10006','2026-06-17','สาย','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('0876d513-e877-476e-a683-02b10c22c7cb','10004','2026-06-16','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('087f0e96-7305-4182-85ca-28a8cec15287','10005','2026-06-15','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('0b9ee1ed-13e0-448c-9509-b2e3c2b6e70a','10005','2026-06-10','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('10730192-bb54-48e1-ae69-6c5a988f9046','10006','2026-07-02','ขาด','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('11aa6fc5-e4c5-4dba-aafd-067457f59c62','10006','2026-06-24','สาย','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('14b57a04-4204-4197-b9d9-82ab782b989f','10004','2026-06-12','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('15b15a7f-b795-4fcf-a379-4d19828b7e45','10005','2026-06-22','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('1c3d5653-4794-47df-9198-8374929b734b','10006','2026-06-23','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('206f8869-a14d-4263-8de0-fe87ecf994a4','10003','2026-07-02','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('21222503-5545-4205-af36-9a7c7ee8a4d8','10002','2026-06-26','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('21e4ab13-2543-4099-96f8-c030c1feb026','10001','2026-06-29','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('2260e3e7-2504-43e2-b9cf-d30d9fecbb86','10001','2026-07-01','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('22c32428-4bb4-45a3-9b0a-8cb0f4d8fdab','10003','2026-06-08','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('25462de6-047a-4bb2-9d20-d951eb27d357','10006','2026-06-18','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('273ea04b-e67e-43ac-9258-226d1a3f3ac3','10003','2026-06-23','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('28a647d9-3e2d-416e-b555-198a66520fe2','10003','2026-06-16','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('2b3b8990-7b78-4f91-b18c-63dd12b73f5e','10002','2026-06-05','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('2c30d087-cfdf-4370-ac22-434b2acce2c0','10001','2026-06-10','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('2c346111-9831-4bf9-860a-761692d8f390','10001','2026-06-16','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('2cefce08-5f59-4c32-b179-ebb3390d52ee','10003','2026-06-10','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('31aad001-af62-4016-9211-d74d015f56df','10004','2026-06-18','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('35d0db2a-7cd1-4371-a65c-870a1f22354d','10006','2026-06-19','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('3a7f1eef-c930-44af-b6c9-7b035b5e52ab','10004','2026-06-15','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('3d4d1df6-a62a-4629-8c83-9f743afb577c','10003','2026-06-09','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('40f78ef1-ac0a-4a18-b28b-09188ef5d5bc','10001','2026-06-18','สาย','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('43955a2f-d515-4370-9a1c-7df4cfa2ac25','10002','2026-06-12','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('43ceec15-69d5-453e-81a2-1d45f645a815','10001','2026-06-12','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('46492e08-2954-40e9-aae4-abe4ce87485a','10003','2026-06-12','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('4c450997-ebb9-48e7-8f16-497cbfa135ff','10005','2026-06-11','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('4dafa155-e88a-451a-8267-98b082b37375','10001','2026-06-22','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('4dc72871-bab8-4ab6-9aeb-2bbf169afb79','10003','2026-06-05','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('4e1ca31d-7a0c-4506-9bc6-065e9f306cbc','10006','2026-06-29','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('4fcce427-ef12-4a60-8ef3-720aadb5d8a8','10004','2026-06-05','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('523ce2aa-c17e-4787-846c-046ae982041b','10003','2026-06-15','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('52dd38f7-60e5-4af0-b795-0c433558f772','10002','2026-07-02','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('56597e9e-387a-4b7b-a7d7-e9af6c755b0e','10006','2026-07-03','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('59683f54-4483-4eee-ba43-6bae35ace007','10005','2026-06-16','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('59816c20-518e-4c26-82f7-a09e743087f9','10005','2026-06-19','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('6409f73e-015b-4c70-8031-9de2096abd0e','10004','2026-07-01','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('69639aae-5f2f-42e8-9602-6dcae7574447','10006','2026-06-25','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('6a52a7b9-e0cd-4ac1-a30b-0e6d0d85a301','10001','2026-06-24','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('7082b656-274e-4c43-aaf1-5601b46000b2','10001','2026-07-02','สาย','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('70b7ba29-e298-40df-af18-a8f9596f5d13','10001','2026-06-23','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('73c32ba0-dc07-45c2-83c5-ab6fadd117d5','10002','2026-06-16','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('7550b666-3ce2-4f48-9f20-47ed265e874a','10001','2026-07-03','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('77662882-bd52-4ad1-b2dd-b99a801c3423','10005','2026-06-17','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('777f7988-1b79-45b5-b1ac-58729e1d0557','10001','2026-06-08','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('78e1991e-6cdc-4359-9b88-ea533274cc3f','10003','2026-06-24','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('7905ede1-2248-4f17-a98c-9b3277efa154','10005','2026-06-18','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('79f3dc26-ff9d-40ab-a341-85cf7dec7a01','10004','2026-06-25','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('7c956cc3-5297-41c7-8663-6494735ae672','10001','2026-06-15','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('80ac5d50-6a26-49b2-b03a-a8618a248df8','10004','2026-06-17','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('82eabf41-e23a-44fb-a2ef-79e6ce989fd4','10002','2026-06-18','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('84e34697-b662-4518-b94f-40e1d0d600f1','10002','2026-06-19','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('872642c4-b5d7-4768-83c0-28d962ed7538','10006','2026-06-10','ขาด','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('884a58b2-902b-423a-9205-4f61a9f10db4','10003','2026-06-30','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('8a320f8b-c43d-41c7-828e-773453f7d8bd','10002','2026-07-03','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('8a71ae10-2b88-46ae-8a9f-cee0c0b5eab1','10001','2026-06-26','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('8ac78ee1-6f52-4497-b7ce-1a971f351cd1','10001','2026-06-09','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('8ad4d83b-3357-49fe-b557-5ee3c95c972f','10002','2026-06-09','สาย','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('8d6595ea-7ce2-404d-8c2a-1133e7bca5f5','10002','2026-06-17','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('8f298d85-62cb-4cde-bb45-51058ac1e5cb','10004','2026-06-08','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('91e7c8eb-bb73-4b79-b9c3-f8eed604a3eb','10004','2026-06-24','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('958deeb2-3618-4e52-bb16-e23a72e35c1f','10006','2026-06-08','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('95e5b394-2cb6-4f7e-8508-15b8d21ce93c','10002','2026-06-29','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('9676f147-ba9b-4024-9101-dc083b4326bb','10003','2026-06-11','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('96af2f8a-bcaf-4057-a2c1-975d3a7a94a2','10005','2026-06-05','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('9a5b39e3-3bb4-4bd0-90b0-b57d9c7d33dd','10006','2026-06-26','สาย','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('9b1904fc-a5a2-4428-88c7-2c98c5c3faec','10001','2026-06-25','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('9b485715-e2de-4c57-9be2-edd4afb859ed','10006','2026-06-22','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('9be9ba93-8b6a-4c3a-83ed-cf7ceb614af0','10003','2026-06-29','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('9bf37f9f-ddc0-4fcd-b2d5-f8c79a7d211e','10006','2026-06-05','สาย','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('9ecc3ce7-d354-4426-a8ed-95bea8756fc8','10003','2026-06-19','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('a0e6ba3b-a712-446a-bea2-9676bbec54fc','10005','2026-06-12','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('a2964c94-e535-48ab-9c54-f7e4b62b65f9','10001','2026-06-11','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('a7b60c3e-f35e-40e8-a819-7ad5da030829','10002','2026-06-15','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('a84a40dd-c683-49d1-81ee-0d126acc8e0a','10004','2026-06-10','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('ad318354-b27b-4625-9497-df214a745041','10004','2026-06-26','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('af6fe6ee-6a74-4c3a-9c31-aae519410d04','10002','2026-06-23','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('b18f92a2-bd0e-4872-8ff9-da49ba05998b','10003','2026-07-03','สาย','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('b28a2255-883a-4c54-865c-645dd31ab0e9','10005','2026-06-08','ขาด','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('b711a30b-b66c-4617-a699-7c50f33e840e','10003','2026-06-26','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('b87be9d2-f412-43ab-a984-4ce19bc2d544','10005','2026-06-24','สาย','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('b944a383-9b9b-4fd5-860b-8fc6f92702ae','10006','2026-07-01','สาย','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('ba4bffe4-ddf9-48e8-91b8-6416cc9a8472','10003','2026-06-25','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('bb13841b-7155-4cc0-8730-5639a03b180b','10004','2026-06-09','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('bbf2fbb6-d2be-44e5-aeb4-c241f38ba4ab','10001','2026-06-19','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('be13c068-64f7-4564-9d34-6ff9a13d78c4','10005','2026-06-25','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('c36fd474-4b6f-4fab-8ca1-2e907812863b','10002','2026-06-24','สาย','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('c512d4e5-04aa-4522-a519-0669d87b7f41','10001','2026-06-30','สาย','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('c5400183-b13a-4c55-abaa-7542701fe5b5','10002','2026-06-30','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('c9fae411-9849-49bc-803a-bf419fcfdae0','10003','2026-06-18','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('ca97d97d-b3c0-497a-a01f-baf735f54184','10002','2026-06-25','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('caff83fc-8b4f-4386-aaa2-f026e0b1e232','10003','2026-07-01','สาย','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('cc6e66ac-0cde-41be-9d96-80bddc3d0267','10005','2026-06-09','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('ce4a5f67-8c0d-42c5-81c6-8404ce225107','10001','2026-06-05','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('d263f61d-2cd8-4ee1-b9a7-4d1514151b17','10005','2026-07-03','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('d54e558b-1ee0-4789-9ffc-cc8706d0471f','10004','2026-06-30','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('d7d71d74-3947-4d08-8525-1435202e1d15','10005','2026-07-01','สาย','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('d823cc68-1f1c-4962-b2c3-a49478c32391','10006','2026-06-11','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('da57dc73-e885-442e-83d9-1cc0d1fb1f95','10005','2026-07-02','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('da99bf29-4304-4037-b696-26065473a94c','10005','2026-06-23','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('dc0587f0-b7d4-4313-8920-715f61e2fa07','10003','2026-06-17','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('dd7b9088-051f-4231-9924-e86e105cc6fe','10002','2026-06-11','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e1c4968a-4e82-4771-a015-6ced67673138','10006','2026-06-16','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e2d96097-aea0-4378-ab65-2dec7f0a9396','10006','2026-06-30','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e41facba-0edc-4f5d-bc17-327145cc298f','10001','2026-06-17','สาย','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e422d46a-2a59-4bf2-b548-eca2b3d3779e','10006','2026-06-15','มา','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e466d92e-04fb-42ec-86d3-88a372e214a4','10004','2026-07-03','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e49219af-5380-42e7-8305-f98dc3460cb3','10004','2026-06-19','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e784f47e-f6e9-4fee-a488-7dcac58ea8b6','10006','2026-06-12','สาย','ac45cb76-028a-458c-9d31-2f4020c72a6e','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e786c146-e76a-4f28-a40b-4e0bdef3a7b9','10004','2026-06-22','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e95fc212-fa14-42e7-bfb8-78da17562a12','10002','2026-07-01','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e9634683-70f7-4bd0-b811-6d639fe73e6a','10005','2026-06-29','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('e9d98049-1848-4a05-9243-2e20c0e3e5b9','10004','2026-06-23','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('ed09ce2c-03cc-4551-b265-ebaa7fb1d7d2','10004','2026-06-29','สาย','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('ed1a9f62-6a92-4622-9419-a3e360cd7f75','10002','2026-06-08','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('ed92b90d-3c92-4a32-b746-5f186ccfd68c','10004','2026-07-02','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('f3bdff2d-2738-4fe2-a58b-fcf11a98c4a4','10005','2026-06-30','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43'),('f9cabbbb-df26-4ec2-9c14-80f4b57ab537','10004','2026-06-11','ขาด','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('fa220260-7202-4f22-b161-ae51dd066f26','10002','2026-06-10','มา','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','2026-07-05 08:48:43','2026-07-05 08:48:43'),('fc1d3391-e46c-4318-bec8-88455e393d20','10005','2026-06-26','มา','8408a9cb-681e-4590-abce-a60b0c813a3c','2026-07-05 08:48:43','2026-07-05 08:48:43');
/*!40000 ALTER TABLE `attendances` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `behavior_records`
--

DROP TABLE IF EXISTS `behavior_records`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `behavior_records` (
  `RecordID` varchar(36) NOT NULL,
  `StudentID` varchar(10) NOT NULL,
  `RuleID` varchar(36) NOT NULL,
  `RecordDate` date NOT NULL,
  `Description` text DEFAULT NULL,
  `RecordedBy` varchar(36) NOT NULL,
  `Status` varchar(50) NOT NULL DEFAULT 'รออนุมัติ',
  `Penalty` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`RecordID`),
  KEY `behavior_records_studentid_foreign` (`StudentID`),
  KEY `behavior_records_ruleid_foreign` (`RuleID`),
  KEY `behavior_records_recordedby_foreign` (`RecordedBy`),
  CONSTRAINT `behavior_records_recordedby_foreign` FOREIGN KEY (`RecordedBy`) REFERENCES `users` (`UserID`) ON DELETE CASCADE,
  CONSTRAINT `behavior_records_ruleid_foreign` FOREIGN KEY (`RuleID`) REFERENCES `behavior_rules` (`RuleID`) ON DELETE CASCADE,
  CONSTRAINT `behavior_records_studentid_foreign` FOREIGN KEY (`StudentID`) REFERENCES `students` (`StudentID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `behavior_records`
--

LOCK TABLES `behavior_records` WRITE;
/*!40000 ALTER TABLE `behavior_records` DISABLE KEYS */;
INSERT INTO `behavior_records` VALUES ('03ac6bbb-9b72-43dd-a1b2-a29a4f4b1081','10005','417e11c4-87ee-4394-ac68-1930c99e2097','2026-05-23','พบพฤติกรรม: แอบอ้างชื่อของผู้อื่นมาใช้แทนตน บริเวณหน้าโรงเรียน','8408a9cb-681e-4590-abce-a60b0c813a3c','อยู่ในระหว่างโต้แย้ง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('122300cd-3e97-474b-a730-fc39603af719','10002','417e11c4-87ee-4394-ac68-1930c99e2097','2026-06-11','พบพฤติกรรม: แอบอ้างชื่อของผู้อื่นมาใช้แทนตน บริเวณหน้าโรงเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','รออนุมัติ','ทำงานสาธารณประโยชน์','2026-07-05 08:48:43','2026-07-05 08:48:43'),('130911a8-9d84-4dda-9bee-ab470e6d4157','10002','39b69054-5446-44aa-b76d-66afb19d3895','2026-06-15','นักเรียนแสดงพฤติกรรมที่ดี: ความประพฤติดีเด่นประจำเดือน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('21500c1e-a2dc-46e3-a77b-a67c4f33678e','10001','e66dcfa4-8fba-401c-8089-444bd6ab6a09','2026-05-26','พบพฤติกรรม: ขีดเขียน ฝาผนัง โต๊ะ เก้าอี้ ในห้องส้วม ห้องเรียน และอาคารประกอบอื่น ๆ บริเวณหน้าโรงเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว','ทำความสะอาด','2026-07-05 08:48:43','2026-07-05 08:48:43'),('252c8fcc-e9be-4b36-86f0-8f714e697c19','10005','50f03807-a4bd-4c03-84d3-920d60e1fbf2','2026-06-15','นักเรียนแสดงพฤติกรรมที่ดี: ช่วยเหลืองานโรงเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('2757ff52-ebe1-4a59-86dd-077c17cb747f','10002','aa97c3f8-5d9f-4c5d-ae03-0db860a4a09a','2026-05-30','พบพฤติกรรม: หลีกเลี่ยงหรือไม่ทำความเคารพครู บริเวณโรงอาหาร','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('53d126ae-e963-451e-be78-e8117afae41d','10003','0109f549-3fc9-4f87-8ece-1c823bf96dfb','2026-06-24','นักเรียนแสดงพฤติกรรมที่ดี: เข้าร่วมกิจกรรมพิเศษ','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('5c47062d-6573-4450-b41a-a995faf76150','10003','2bb082f8-db92-4853-be4a-44a03003753e','2026-06-15','พบพฤติกรรม: จำหน่าย จ่ายแจก เอกสาร สื่ออิเล็กทรอนิกส์ และสิ่งของที่ใช้ในการบริโภค โดยมิได้ขออนุญาต บริเวณหน้าโรงเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','รออนุมัติ','แจ้งผู้ปกครอง','2026-07-05 08:48:43','2026-07-05 08:48:43'),('5d04bdf9-9263-4ef6-9584-66316d7fc3a8','10001','428f5a3b-72ab-453b-b454-22d631b01e47','2026-07-04','พบพฤติกรรม: มาโรงเรียนสายหลัง 08.00 น. โดยไม่มีเหตุอันสมควร บริเวณห้องเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','รออนุมัติ','ทำงานสาธารณประโยชน์','2026-07-05 08:48:43','2026-07-05 08:48:43'),('6178cfa8-f99f-4aee-82e4-ba52bfcdb901','10006','fcb88370-a717-4fe4-8243-9b6900771d6d','2026-06-22','พบพฤติกรรม: หนีไม่เข้าชั้นเรียน บริเวณห้องเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว','ทำงานสาธารณประโยชน์','2026-07-05 08:48:43','2026-07-05 08:48:43'),('6843c33b-1828-4e70-b6bb-2f511e4ed836','10004','50f03807-a4bd-4c03-84d3-920d60e1fbf2','2026-06-27','นักเรียนแสดงพฤติกรรมที่ดี: ช่วยเหลืองานโรงเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('6db1faf8-e359-4320-8f49-2e2fd4a1f53c','10006','9fd14a49-c6e6-4a02-9c5a-1763c749bf72','2026-06-09','พบพฤติกรรม: กล่าวเท็จ ช่วยเหลือ ปกปิด ผู้กระทำความผิดอันเกิดความเสียหายต่อผู้อื่นและส่วนรวม บริเวณสนาม','1d4daca7-56f6-423d-8615-b0271aa20b7c','รออนุมัติ','ทำงานสาธารณประโยชน์','2026-07-05 08:48:43','2026-07-05 08:48:43'),('72487a62-a693-4157-83ba-e63cabec3bfe','10005','9fd14a49-c6e6-4a02-9c5a-1763c749bf72','2026-05-18','พบพฤติกรรม: กล่าวเท็จ ช่วยเหลือ ปกปิด ผู้กระทำความผิดอันเกิดความเสียหายต่อผู้อื่นและส่วนรวม บริเวณสนาม','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว','ทำความสะอาด','2026-07-05 08:48:43','2026-07-05 08:48:43'),('75776f69-d974-4ce2-b5f0-07b249bfbb93','10005','3beac7b2-cf00-436e-894a-10c27a48a533','2026-05-08','พบพฤติกรรม: ลักขโมยและมีส่วนร่วมในการลักขโมยของผู้อื่นมาเป็นตนโดยเจตนา บริเวณห้องเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','รออนุมัติ','แจ้งผู้ปกครอง','2026-07-05 08:48:43','2026-07-05 08:48:43'),('7943b244-ad1b-47e8-81c6-c24b9b3ad57e','10002','9fd14a49-c6e6-4a02-9c5a-1763c749bf72','2026-07-02','พบพฤติกรรม: กล่าวเท็จ ช่วยเหลือ ปกปิด ผู้กระทำความผิดอันเกิดความเสียหายต่อผู้อื่นและส่วนรวม บริเวณห้องเรียน','8408a9cb-681e-4590-abce-a60b0c813a3c','อนุมัติแล้ว','ทำความสะอาด','2026-07-05 08:48:43','2026-07-05 08:48:43'),('79a7a404-d95b-47fe-8b4c-873d9ae57eaf','10004','2e325fb6-ec64-4bfa-b4ab-c6262287ddab','2026-05-15','พบพฤติกรรม: ปลอมแปลงเอกสาร แอบอ้างกิจกรรมของโรงเรียนต่อผู้ปกครองอันเป็นเท็จ บริเวณห้องเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','รออนุมัติ','ทำงานสาธารณประโยชน์','2026-07-05 08:48:43','2026-07-05 08:48:43'),('8b03c439-d0b1-43df-80ad-8fa393215d89','10006','d62e9358-73f8-442b-8a2c-08c81ea7a866','2026-05-22','พบพฤติกรรม: หยอกล้อ เล่นกันรุนแรง จนเกิดบาดแผลหรือบาดเจ็บ บริเวณห้องเรียน','8408a9cb-681e-4590-abce-a60b0c813a3c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('8d4cd575-e7b9-43f4-898d-70e53d127e36','10001','54e99574-12e2-437f-9ffc-feb61d466254','2026-06-21','นักเรียนแสดงพฤติกรรมที่ดี: ไม่มีบันทึกพฤติกรรมเชิงลบทั้งภาคเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('9115907f-77ad-4497-8154-2c4b369335d9','10001','76d95272-08d4-4acc-afeb-0e0a9ab484b6','2026-06-19','พบพฤติกรรม: ซื้อเครื่องดื่ม ขนม อาหารว่างริมรั้วโรงเรียน บริเวณหน้าโรงเรียน','8408a9cb-681e-4590-abce-a60b0c813a3c','อนุมัติแล้ว','แจ้งผู้ปกครอง','2026-07-05 08:48:43','2026-07-05 08:48:43'),('98725ac6-24b4-4998-b90a-68680fda98f9','10003','8f962e7e-b81d-4d3f-8fd6-5c703a735594','2026-05-25','พบพฤติกรรม: นำอาหาร ขนม หรือเครื่องดื่มทุกชนิดขึ้นไปทานบนอาคารเรียน บริเวณโรงอาหาร','8408a9cb-681e-4590-abce-a60b0c813a3c','อนุมัติแล้ว','ทำความสะอาด','2026-07-05 08:48:43','2026-07-05 08:48:43'),('a2e3e12e-5b96-4520-a11c-ae7e1c631d7a','10001','0109f549-3fc9-4f87-8ece-1c823bf96dfb','2026-06-15','นักเรียนแสดงพฤติกรรมที่ดี: เข้าร่วมกิจกรรมพิเศษ','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('b001e634-4b7e-4d39-8b1f-0ea50b4f5b81','10004','fa227d55-1b8e-483e-a1e5-9f8e63255d2c','2026-06-08','พบพฤติกรรม: ทำลายทรัพย์สินของผู้อื่นและของโรงเรียน บริเวณโรงอาหาร','8408a9cb-681e-4590-abce-a60b0c813a3c','อยู่ในระหว่างโต้แย้ง','ทำความสะอาด','2026-07-05 08:48:43','2026-07-05 08:48:43'),('bc4e7cc2-0041-49b9-a47e-5e93e93736d3','10005','54e99574-12e2-437f-9ffc-feb61d466254','2026-07-01','นักเรียนแสดงพฤติกรรมที่ดี: ไม่มีบันทึกพฤติกรรมเชิงลบทั้งภาคเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('c35fbc1e-a1f0-42d7-8eab-4e4458354eb9','10003','e78acf53-bdf1-4413-9a8b-99ee173e9648','2026-06-28','นักเรียนแสดงพฤติกรรมที่ดี: ช่วยเหลือเพื่อน/ผู้อื่น','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('c4797c84-070b-4a0e-b1b3-52c4ab241fab','10003','c8d17e8a-a399-4295-88a3-fb99823bac2a','2026-05-28','พบพฤติกรรม: ความผิดไม่ร้ายแรงอื่น ๆ (ตามดุลพินิจหัวหน้าระดับชั้น/หัวหน้าฝ่าย) บริเวณโรงอาหาร','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('c73ee040-e4e0-4b31-a217-d4bff1dd6694','10004','fcb88370-a717-4fe4-8243-9b6900771d6d','2026-05-10','พบพฤติกรรม: หนีไม่เข้าชั้นเรียน บริเวณห้องเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว','ทำความสะอาด','2026-07-05 08:48:43','2026-07-05 08:48:43'),('c77fd33e-8bcf-4542-8f6d-75fae156cdc0','10006','c5876977-f349-42b3-9f88-38f6f2fb25b4','2026-06-15','นักเรียนแสดงพฤติกรรมที่ดี: ชนะการแข่งขัน/ตัวแทนโรงเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('d6b16bad-628a-4e48-9fd1-2cd779ed5410','10004','0109f549-3fc9-4f87-8ece-1c823bf96dfb','2026-06-27','นักเรียนแสดงพฤติกรรมที่ดี: เข้าร่วมกิจกรรมพิเศษ','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('d8dab6b5-6140-4d89-8858-ce1b192c8409','10002','c5876977-f349-42b3-9f88-38f6f2fb25b4','2026-06-15','นักเรียนแสดงพฤติกรรมที่ดี: ชนะการแข่งขัน/ตัวแทนโรงเรียน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('dd6d9f2b-18f9-47b9-b6ed-5afb7da58106','10006','39b69054-5446-44aa-b76d-66afb19d3895','2026-06-08','นักเรียนแสดงพฤติกรรมที่ดี: ความประพฤติดีเด่นประจำเดือน','1d4daca7-56f6-423d-8615-b0271aa20b7c','อนุมัติแล้ว',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43');
/*!40000 ALTER TABLE `behavior_records` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `behavior_rules`
--

DROP TABLE IF EXISTS `behavior_rules`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `behavior_rules` (
  `RuleID` varchar(36) NOT NULL,
  `RuleName` varchar(100) NOT NULL,
  `RuleType` varchar(50) NOT NULL,
  `ScoreModifier` int(11) NOT NULL,
  `Category` varchar(100) DEFAULT NULL,
  `Description` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`RuleID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `behavior_rules`
--

LOCK TABLES `behavior_rules` WRITE;
/*!40000 ALTER TABLE `behavior_rules` DISABLE KEYS */;
INSERT INTO `behavior_rules` VALUES ('0109f549-3fc9-4f87-8ece-1c823bf96dfb','เข้าร่วมกิจกรรมพิเศษ','เพิ่มคะแนน',5,'กิจกรรม',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('07105377-052f-43c3-9a84-a79ec4f6fd5c','หลีกเลี่ยงการปฏิบัติกิจกรรมหน้าเสาธงในตอนเช้า','ตัดคะแนน',-10,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('09450b1e-8dfc-4de8-b120-6257e2ef13f7','การนำข้อมูลข่าวสารอันเป็นเท็จเข้าสู่ระบบคอมพิวเตอร์สื่อออนไลน์','ตัดคะแนน',-20,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('1d38ae42-1b20-4814-a897-0be89a741788','ทำร้ายร่างกายเพื่อนนักเรียนได้รับบาดเจ็บมีบาดแผลเล็กน้อย','ตัดคะแนน',-30,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('249f00de-4fbd-40a6-83de-39094871035a','ก่อเหตุทะเลาะวิวาททั่วไป','ตัดคะแนน',-20,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('28dd8f26-176b-4c72-b77b-0567d5863bcf','เสพสารเสพติด เช่น บุหรี่ กัญชา ยาบ้า หรืออุปกรณ์ในการเสพ มีไว้ในครอบครองหรือจำหน่าย','ตัดคะแนน',-50,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('2bb082f8-db92-4853-be4a-44a03003753e','จำหน่าย จ่ายแจก เอกสาร สื่ออิเล็กทรอนิกส์ และสิ่งของที่ใช้ในการบริโภค โดยมิได้ขออนุญาต','ตัดคะแนน',-30,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('2e325fb6-ec64-4bfa-b4ab-c6262287ddab','ปลอมแปลงเอกสาร แอบอ้างกิจกรรมของโรงเรียนต่อผู้ปกครองอันเป็นเท็จ','ตัดคะแนน',-10,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('39b69054-5446-44aa-b76d-66afb19d3895','ความประพฤติดีเด่นประจำเดือน','เพิ่มคะแนน',10,'ความประพฤติ',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('3beac7b2-cf00-436e-894a-10c27a48a533','ลักขโมยและมีส่วนร่วมในการลักขโมยของผู้อื่นมาเป็นตนโดยเจตนา','ตัดคะแนน',-30,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('3c730205-ae2a-4bef-89d1-2e8de86a734a','แสดงตนเป็นนักเลง อันธพาล ก่อกวนความสงบสุขภายในห้องเรียน ปลุกปั่นยุยงให้เกิดการแตกแยก','ตัดคะแนน',-50,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('3eb4c7a1-36d1-4972-bb76-74a06be3c2b3','ไม่ทิ้งขยะลงในภาชนะที่รองรับ ทำให้สถานที่สกปรก','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('3fb302b1-f8cd-442f-b976-5da03919d79c','ใช้เครื่องประดับตกแต่งร่างกาย ใบหน้าอย่างไม่เหมาะสม','ตัดคะแนน',-10,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('417e11c4-87ee-4394-ac68-1930c99e2097','แอบอ้างชื่อของผู้อื่นมาใช้แทนตน','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('428f5a3b-72ab-453b-b454-22d631b01e47','มาโรงเรียนสายหลัง 08.00 น. โดยไม่มีเหตุอันสมควร','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('50f03807-a4bd-4c03-84d3-920d60e1fbf2','ช่วยเหลืองานโรงเรียน','เพิ่มคะแนน',5,'ความดี',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('54e99574-12e2-437f-9ffc-feb61d466254','ไม่มีบันทึกพฤติกรรมเชิงลบทั้งภาคเรียน','เพิ่มคะแนน',10,'ความประพฤติ',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('58585a33-b678-4b92-925a-39052441c52d','เล่นประทัดหรือดอกไม้ไฟภายในโรงเรียน','ตัดคะแนน',-50,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('58a26a8e-baff-4a2c-810a-8304f0af2909','นำหนังสือ สื่อสิ่งพิมพ์ลามกอนาจาร เข้ามาเผยแพร่ในโรงเรียน','ตัดคะแนน',-20,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('58eee624-60a3-4c7f-8d9e-05f1d9de1dc4','ประพฤติผิดในทางชู้สาว ละเมิดทางเพศ ก่อนวัยอันควร','ตัดคะแนน',-50,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('66d2ad5b-b450-496d-91aa-343cdc63338e','นักเรียนหญิงซอยผม','ตัดคะแนน',-30,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('715a5716-d851-463c-be0a-d2e0db38deeb','เข้าและออกริมรั้วโรงเรียน โดยไม่ได้อนุญาต (ปีนรั้ว, ลอดรั้ว)','ตัดคะแนน',-20,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('76d95272-08d4-4acc-afeb-0e0a9ab484b6','ซื้อเครื่องดื่ม ขนม อาหารว่างริมรั้วโรงเรียน','ตัดคะแนน',-10,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('869bce35-acab-452e-8946-edb728b162f1','ไม่สำรวมกิริยามารยาท นอกบริเวณโรงเรียนขณะอยู่ในเครื่องแบบนักเรียน','ตัดคะแนน',-10,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('8f962e7e-b81d-4d3f-8fd6-5c703a735594','นำอาหาร ขนม หรือเครื่องดื่มทุกชนิดขึ้นไปทานบนอาคารเรียน','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('9fd14a49-c6e6-4a02-9c5a-1763c749bf72','กล่าวเท็จ ช่วยเหลือ ปกปิด ผู้กระทำความผิดอันเกิดความเสียหายต่อผู้อื่นและส่วนรวม','ตัดคะแนน',-10,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('a745a226-24fe-4805-85d7-ffd23c22d776','มีพฤติกรรมลามกอนาจารนักเรียนด้วยกัน','ตัดคะแนน',-20,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('aa97c3f8-5d9f-4c5d-ae03-0db860a4a09a','หลีกเลี่ยงหรือไม่ทำความเคารพครู','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('b7ced745-9c50-479a-8753-427f9743e023','ใช้โทรศัพท์ เครื่องมือสื่อสารในโรงเรียนผิดวัตถุประสงค์และไม่เหมาะสมกับกาลเทศะ','ตัดคะแนน',-10,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('c5876977-f349-42b3-9f88-38f6f2fb25b4','ชนะการแข่งขัน/ตัวแทนโรงเรียน','เพิ่มคะแนน',10,'กิจกรรม',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('c593aa9a-067e-465d-a355-41e03e920e63','เอาชายเสื้อออกนอกกางเกง กระโปรง (เครื่องแบบนักเรียนไทยพุทธ)','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('c8d17e8a-a399-4295-88a3-fb99823bac2a','ความผิดไม่ร้ายแรงอื่น ๆ (ตามดุลพินิจหัวหน้าระดับชั้น/หัวหน้าฝ่าย)','ตัดคะแนน',-10,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('d62e9358-73f8-442b-8a2c-08c81ea7a866','หยอกล้อ เล่นกันรุนแรง จนเกิดบาดแผลหรือบาดเจ็บ','ตัดคะแนน',-10,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('e66dcfa4-8fba-401c-8089-444bd6ab6a09','ขีดเขียน ฝาผนัง โต๊ะ เก้าอี้ ในห้องส้วม ห้องเรียน และอาคารประกอบอื่น ๆ','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('e78acf53-bdf1-4413-9a8b-99ee173e9648','ช่วยเหลือเพื่อน/ผู้อื่น','เพิ่มคะแนน',5,'ความดี',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('ec1d7d70-48e6-4bd8-911c-0a9f72ca8cf1','มาสายหลังจากเข้าคาบเรียนที่ 1 โดยไม่มีเหตุอันควร','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('f2757afd-6e04-46f2-92fb-fb74abe01445','แต่งกายผิดระเบียบ','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('fa227d55-1b8e-483e-a1e5-9f8e63255d2c','ทำลายทรัพย์สินของผู้อื่นและของโรงเรียน','ตัดคะแนน',-20,'ความผิดร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('fcb88370-a717-4fe4-8243-9b6900771d6d','หนีไม่เข้าชั้นเรียน','ตัดคะแนน',-5,'ความผิดไม่ร้ายแรง',NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43');
/*!40000 ALTER TABLE `behavior_rules` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cache`
--

DROP TABLE IF EXISTS `cache`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cache` (
  `key` varchar(255) NOT NULL,
  `value` mediumtext NOT NULL,
  `expiration` int(11) NOT NULL,
  PRIMARY KEY (`key`),
  KEY `cache_expiration_index` (`expiration`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cache`
--

LOCK TABLES `cache` WRITE;
/*!40000 ALTER TABLE `cache` DISABLE KEYS */;
/*!40000 ALTER TABLE `cache` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cache_locks`
--

DROP TABLE IF EXISTS `cache_locks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cache_locks` (
  `key` varchar(255) NOT NULL,
  `owner` varchar(255) NOT NULL,
  `expiration` int(11) NOT NULL,
  PRIMARY KEY (`key`),
  KEY `cache_locks_expiration_index` (`expiration`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cache_locks`
--

LOCK TABLES `cache_locks` WRITE;
/*!40000 ALTER TABLE `cache_locks` DISABLE KEYS */;
/*!40000 ALTER TABLE `cache_locks` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `discipline_staff`
--

DROP TABLE IF EXISTS `discipline_staff`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `discipline_staff` (
  `StaffID` varchar(36) NOT NULL,
  `UserID` varchar(36) NOT NULL,
  `Position` varchar(100) DEFAULT NULL,
  `Level` enum('บันทึกได้','อนุมัติผล/ตั้งค่า') NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`StaffID`),
  KEY `discipline_staff_userid_foreign` (`UserID`),
  CONSTRAINT `discipline_staff_userid_foreign` FOREIGN KEY (`UserID`) REFERENCES `users` (`UserID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `discipline_staff`
--

LOCK TABLES `discipline_staff` WRITE;
/*!40000 ALTER TABLE `discipline_staff` DISABLE KEYS */;
INSERT INTO `discipline_staff` VALUES ('5918a453-9263-4057-9b15-f33acf32e216','72df7ac0-b2a5-4da6-873e-d8bf87532892','เจ้าหน้าที่ฝ่ายปกครอง','บันทึกได้','2026-07-05 08:48:40','2026-07-05 08:48:40'),('bbffa6f2-05ec-404f-a508-3da4ff7637a6','1d4daca7-56f6-423d-8615-b0271aa20b7c','หัวหน้าฝ่ายปกครอง','อนุมัติผล/ตั้งค่า','2026-07-05 08:48:40','2026-07-05 08:48:40');
/*!40000 ALTER TABLE `discipline_staff` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `failed_jobs`
--

DROP TABLE IF EXISTS `failed_jobs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `failed_jobs` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `failed_jobs`
--

LOCK TABLES `failed_jobs` WRITE;
/*!40000 ALTER TABLE `failed_jobs` DISABLE KEYS */;
/*!40000 ALTER TABLE `failed_jobs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `informant_reports`
--

DROP TABLE IF EXISTS `informant_reports`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `informant_reports` (
  `ReportID` varchar(36) NOT NULL,
  `Title` varchar(100) DEFAULT NULL,
  `Category` varchar(50) DEFAULT NULL,
  `Description` text NOT NULL,
  `IsAnonymous` tinyint(1) NOT NULL DEFAULT 0,
  `ReporterName` varchar(100) DEFAULT NULL,
  `ReporterID` varchar(36) DEFAULT NULL,
  `StudentID` varchar(10) DEFAULT NULL,
  `EvidencePath` varchar(255) DEFAULT NULL,
  `Status` varchar(50) NOT NULL DEFAULT 'เรื่องใหม่',
  `Remarks` text DEFAULT NULL,
  `ReportDate` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`ReportID`),
  KEY `informant_reports_reporterid_foreign` (`ReporterID`),
  KEY `informant_reports_studentid_foreign` (`StudentID`),
  CONSTRAINT `informant_reports_reporterid_foreign` FOREIGN KEY (`ReporterID`) REFERENCES `users` (`UserID`) ON DELETE SET NULL,
  CONSTRAINT `informant_reports_studentid_foreign` FOREIGN KEY (`StudentID`) REFERENCES `students` (`StudentID`) ON DELETE SET NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `informant_reports`
--

LOCK TABLES `informant_reports` WRITE;
/*!40000 ALTER TABLE `informant_reports` DISABLE KEYS */;
INSERT INTO `informant_reports` VALUES ('454391aa-8ead-457c-b6a5-7af7d64b220a','พฤติกรรมสูบบุหรี่หลังโรงเรียน','สิ่งเสพติดและอบายมุข','พบนักเรียนกลุ่มหนึ่งสูบบุหรี่บริเวณหลังโรงเรียน ช่วงพักกลางวัน ประมาณ 3–4 คน',1,NULL,NULL,'10004',NULL,'กำลังตรวจสอบ',NULL,'2026-07-05 15:48:44','2026-07-02 08:48:44','2026-07-02 08:48:44'),('99425ddd-d59f-4687-a65a-5a92389cc569','นักเรียนลักลอบออกนอกโรงเรียน','หนีเรียน','นักเรียนชั้น ม.2 กลุ่มหนึ่งมักออกนอกโรงเรียนในช่วงพัก โดยไม่ได้รับอนุญาต',0,'นายซูไฮมี มะเซ็ง','8408a9cb-681e-4590-abce-a60b0c813a3c','10005',NULL,'ดำเนินการแล้ว',NULL,'2026-07-05 15:48:44','2026-06-20 08:48:44','2026-06-20 08:48:44'),('99ab035b-5120-4b51-89d3-60691dceadc3','เหตุลักขโมยทรัพย์สินในห้องเรียน ม.1/1','อื่นๆ','มีการลักขโมยของในห้องเรียน ม.1/1 หลายครั้งในสัปดาห์นี้',0,'ด.ช. เก่ง เรียนดี','stud-uuid-1','10001',NULL,'กำลังตรวจสอบ',NULL,'2026-07-05 15:48:44','2026-07-01 08:48:44','2026-07-01 08:48:44'),('cab58262-ce5a-4fda-94cc-0aa135f5c5ca','พกพาสิ่งของมีคมเข้าโรงเรียน','อื่นๆ','นักเรียนนำสิ่งของมีคมเข้าโรงเรียน พบในกระเป๋านักเรียนชั้น ม.3',1,NULL,NULL,'10006',NULL,'รอดำเนินการ',NULL,'2026-07-05 15:48:44','2026-07-03 08:48:44','2026-07-03 08:48:44'),('ce0db17e-ef0d-46f1-85af-08dfca1fc7ab','ทุจริตนำโทรศัพท์เข้าห้องสอบ','อื่นๆ','มีนักเรียนนำโทรศัพท์เข้าห้องสอบ สังเกตเห็นในช่วงสอบกลางภาค',0,'ด.ช. เก่ง เรียนดี','stud-uuid-1','10002',NULL,'รอดำเนินการ',NULL,'2026-07-05 15:48:44','2026-07-04 08:48:44','2026-07-04 08:48:44'),('f12fedc3-bf0b-4577-9dc7-387aceda76c5','เหตุทะเลาะวิวาทบริเวณโรงอาหาร','ทะเลาะวิวาท','พบการทะเลาะวิวาทระหว่างนักเรียนต่างห้อง บริเวณโรงอาหาร',1,NULL,NULL,'10003',NULL,'กำลังตรวจสอบ',NULL,'2026-07-05 15:48:44','2026-06-30 08:48:44','2026-06-30 08:48:44');
/*!40000 ALTER TABLE `informant_reports` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `job_batches`
--

DROP TABLE IF EXISTS `job_batches`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `job_batches` (
  `id` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `total_jobs` int(11) NOT NULL,
  `pending_jobs` int(11) NOT NULL,
  `failed_jobs` int(11) NOT NULL,
  `failed_job_ids` longtext NOT NULL,
  `options` mediumtext DEFAULT NULL,
  `cancelled_at` int(11) DEFAULT NULL,
  `created_at` int(11) NOT NULL,
  `finished_at` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `job_batches`
--

LOCK TABLES `job_batches` WRITE;
/*!40000 ALTER TABLE `job_batches` DISABLE KEYS */;
/*!40000 ALTER TABLE `job_batches` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `jobs`
--

DROP TABLE IF EXISTS `jobs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `jobs` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `queue` varchar(255) NOT NULL,
  `payload` longtext NOT NULL,
  `attempts` tinyint(3) unsigned NOT NULL,
  `reserved_at` int(10) unsigned DEFAULT NULL,
  `available_at` int(10) unsigned NOT NULL,
  `created_at` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`),
  KEY `jobs_queue_index` (`queue`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `jobs`
--

LOCK TABLES `jobs` WRITE;
/*!40000 ALTER TABLE `jobs` DISABLE KEYS */;
/*!40000 ALTER TABLE `jobs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `messages`
--

DROP TABLE IF EXISTS `messages`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `messages` (
  `MessageID` varchar(36) NOT NULL,
  `SenderID` varchar(36) NOT NULL,
  `ReceiverID` varchar(36) NOT NULL,
  `Content` text NOT NULL,
  `SentDate` datetime NOT NULL,
  `IsRead` tinyint(1) NOT NULL DEFAULT 0,
  `AttachmentDir` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`MessageID`),
  KEY `messages_senderid_foreign` (`SenderID`),
  KEY `messages_receiverid_foreign` (`ReceiverID`),
  CONSTRAINT `messages_receiverid_foreign` FOREIGN KEY (`ReceiverID`) REFERENCES `users` (`UserID`) ON DELETE CASCADE,
  CONSTRAINT `messages_senderid_foreign` FOREIGN KEY (`SenderID`) REFERENCES `users` (`UserID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `messages`
--

LOCK TABLES `messages` WRITE;
/*!40000 ALTER TABLE `messages` DISABLE KEYS */;
/*!40000 ALTER TABLE `messages` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `migrations`
--

DROP TABLE IF EXISTS `migrations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `migrations` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `migrations`
--

LOCK TABLES `migrations` WRITE;
/*!40000 ALTER TABLE `migrations` DISABLE KEYS */;
INSERT INTO `migrations` VALUES (1,'0001_01_01_000000_create_users_table',1),(2,'0001_01_01_000001_create_cache_table',1),(3,'0001_01_01_000002_create_jobs_table',1),(4,'2026_06_07_141750_create_behavior_rules_table',1),(5,'2026_06_07_141756_create_users_table',1),(6,'2026_06_07_141757_create_teachers_table',1),(7,'2026_06_07_141758_create_discipline_staff_table',1),(8,'2026_06_07_141758_create_parents_table',1),(9,'2026_06_07_141758_create_students_table',1),(10,'2026_06_07_141759_add_fk_studentid_to_parents_table',1),(11,'2026_06_07_141759_create_behavior_records_table',1),(12,'2026_06_07_141760_create_appeals_table',1),(13,'2026_06_07_141800_create_attendances_table',1),(14,'2026_06_07_141800_create_informant_reports_table',1),(15,'2026_06_07_141800_create_messages_table',1),(16,'2026_06_07_141801_create_role_permissions_table',1),(17,'2026_06_11_160140_add_gender_and_photo_to_students_table',1),(18,'2026_06_11_160149_create_prayer_records_table',1),(19,'2026_06_14_220000_create_prayer_corrections_table',1),(20,'2026_07_05_000000_add_email_to_users_table',1);
/*!40000 ALTER TABLE `migrations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `parents`
--

DROP TABLE IF EXISTS `parents`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `parents` (
  `ParentID` varchar(36) NOT NULL,
  `UserID` varchar(36) NOT NULL,
  `StudentID` varchar(10) DEFAULT NULL,
  `Relationship` enum('พ่อ','แม่','ญาติ') NOT NULL,
  `FirstName` varchar(50) NOT NULL,
  `LastName` varchar(50) NOT NULL,
  `Phone` varchar(15) DEFAULT NULL,
  `Email` varchar(100) DEFAULT NULL,
  `Address` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`ParentID`),
  KEY `parents_userid_foreign` (`UserID`),
  KEY `parents_studentid_foreign` (`StudentID`),
  CONSTRAINT `parents_studentid_foreign` FOREIGN KEY (`StudentID`) REFERENCES `students` (`StudentID`) ON DELETE SET NULL,
  CONSTRAINT `parents_userid_foreign` FOREIGN KEY (`UserID`) REFERENCES `users` (`UserID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `parents`
--

LOCK TABLES `parents` WRITE;
/*!40000 ALTER TABLE `parents` DISABLE KEYS */;
INSERT INTO `parents` VALUES ('parent-uuid-1','parent-uuid-1','10001','พ่อ','นายสมคิด','เรียนดี','0812345678','prt10001@example.com','123/45 ถนนราษฎร์บำรุง อำเภอเมือง จังหวัดเชียงใหม่','2026-07-05 08:48:41','2026-07-05 08:48:41'),('parent-uuid-2','parent-uuid-2','10002','แม่','นางกัลยา','รักดี','0812345678','prt10002@example.com','123/45 ถนนราษฎร์บำรุง อำเภอเมือง จังหวัดเชียงใหม่','2026-07-05 08:48:42','2026-07-05 08:48:42'),('parent-uuid-3','parent-uuid-3','10003','พ่อ','นายขจร','พากเพียร','0812345678','prt10003@example.com','123/45 ถนนราษฎร์บำรุง อำเภอเมือง จังหวัดเชียงใหม่','2026-07-05 08:48:42','2026-07-05 08:48:42'),('parent-uuid-4','parent-uuid-4','10004','พ่อ','นายดนัย','ดนตรี','0812345678','prt10004@example.com','123/45 ถนนราษฎร์บำรุง อำเภอเมือง จังหวัดเชียงใหม่','2026-07-05 08:48:42','2026-07-05 08:48:42'),('parent-uuid-5','parent-uuid-5','10005','แม่','นางสมศรี','ยินดี','0812345678','prt10005@example.com','123/45 ถนนราษฎร์บำรุง อำเภอเมือง จังหวัดเชียงใหม่','2026-07-05 08:48:43','2026-07-05 08:48:43'),('parent-uuid-6','parent-uuid-6','10006','พ่อ','นายประสงค์','เลิศล้ำ','0812345678','prt10006@example.com','123/45 ถนนราษฎร์บำรุง อำเภอเมือง จังหวัดเชียงใหม่','2026-07-05 08:48:43','2026-07-05 08:48:43');
/*!40000 ALTER TABLE `parents` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `password_reset_tokens`
--

DROP TABLE IF EXISTS `password_reset_tokens`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `password_reset_tokens`
--

LOCK TABLES `password_reset_tokens` WRITE;
/*!40000 ALTER TABLE `password_reset_tokens` DISABLE KEYS */;
/*!40000 ALTER TABLE `password_reset_tokens` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prayer_corrections`
--

DROP TABLE IF EXISTS `prayer_corrections`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `prayer_corrections` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `StudentID` varchar(10) NOT NULL,
  `Year` int(11) NOT NULL,
  `Month` int(11) NOT NULL,
  `Status` varchar(50) NOT NULL DEFAULT 'แก้ละหมาดแล้ว',
  `RecordedBy` varchar(36) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `prayer_corrections_studentid_year_month_unique` (`StudentID`,`Year`,`Month`),
  KEY `prayer_corrections_recordedby_foreign` (`RecordedBy`),
  CONSTRAINT `prayer_corrections_recordedby_foreign` FOREIGN KEY (`RecordedBy`) REFERENCES `users` (`UserID`) ON DELETE CASCADE,
  CONSTRAINT `prayer_corrections_studentid_foreign` FOREIGN KEY (`StudentID`) REFERENCES `students` (`StudentID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prayer_corrections`
--

LOCK TABLES `prayer_corrections` WRITE;
/*!40000 ALTER TABLE `prayer_corrections` DISABLE KEYS */;
/*!40000 ALTER TABLE `prayer_corrections` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prayer_records`
--

DROP TABLE IF EXISTS `prayer_records`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `prayer_records` (
  `PrayerRecordID` varchar(36) NOT NULL,
  `StudentID` varchar(10) NOT NULL,
  `RecordDate` date NOT NULL,
  `RecordTime` time NOT NULL,
  `Period` varchar(20) NOT NULL,
  `Status` varchar(50) NOT NULL,
  `RecordedBy` varchar(36) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`PrayerRecordID`),
  UNIQUE KEY `prayer_records_studentid_recorddate_period_unique` (`StudentID`,`RecordDate`,`Period`),
  KEY `prayer_records_recordedby_foreign` (`RecordedBy`),
  CONSTRAINT `prayer_records_recordedby_foreign` FOREIGN KEY (`RecordedBy`) REFERENCES `users` (`UserID`) ON DELETE CASCADE,
  CONSTRAINT `prayer_records_studentid_foreign` FOREIGN KEY (`StudentID`) REFERENCES `students` (`StudentID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prayer_records`
--

LOCK TABLES `prayer_records` WRITE;
/*!40000 ALTER TABLE `prayer_records` DISABLE KEYS */;
/*!40000 ALTER TABLE `prayer_records` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `role_permissions`
--

DROP TABLE IF EXISTS `role_permissions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `role_permissions` (
  `PermissionID` varchar(36) NOT NULL,
  `Role` varchar(50) NOT NULL,
  `ModuleName` varchar(50) NOT NULL,
  `CanAccess` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`PermissionID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `role_permissions`
--

LOCK TABLES `role_permissions` WRITE;
/*!40000 ALTER TABLE `role_permissions` DISABLE KEYS */;
INSERT INTO `role_permissions` VALUES ('013a3f65-b971-4c1e-83fe-683d4063a17a','ครู','messages',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('082e28c2-684d-4479-8820-096a93a6b18d','ผู้ปกครอง','informant-reports',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('0a462dcd-f838-474f-bd74-89134721498f','ฝ่ายปกครอง','permissions',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('0a94681e-5ee8-40ea-a82b-262866de7504','ผู้ปกครอง','permissions',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('0acd3f5e-e525-44a0-b25e-ad342795be19','ผู้ดูแลระบบ','dashboard',1,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('0ffa5e07-2670-4275-98f4-9d1ff21be4b5','ฝ่ายปกครอง','dashboard',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('197589ad-c31a-4c91-9903-207c2753fdb6','ผู้ดูแลระบบ','behavior-rules',1,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('1ea47c1d-c0f3-474b-8900-0424b4bbe03a','ผู้ดูแลระบบ','messages',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('1ec9f866-6fc6-4af6-8c3f-aa7c271f7a44','นักเรียน','behavior-rules',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('2241bf54-37cc-4043-b4da-738658874c49','ผู้ดูแลระบบ','attendance',1,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('2745e358-ba0a-4365-8292-3dd4cc1c664f','ครู','behavior-rules',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('29e54ba2-9e83-42a6-96d8-f909feaf4e22','นักเรียน','users',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('2c9df322-2557-435f-a54d-313ac9475581','นักเรียน','messages',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('333dbe0f-8f8f-4692-8834-aa9e3ceea664','ฝ่ายปกครอง','messages',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('416fd003-14c3-4840-9b19-2b8783ab0c2b','ครู','behavior-records',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('59afa644-666b-43d4-8539-e4a5c2b6dfb0','ฝ่ายปกครอง','behavior-rules',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('606c821c-2d6b-4b9f-9c64-30a86df5c18b','ผู้ปกครอง','risk-students',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('62aea9b6-c31e-4438-8dae-a2f59ded2f63','ฝ่ายปกครอง','appeals',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('70ef19df-3803-4329-8af7-8a3ef17604d9','ผู้ปกครอง','dashboard',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('8017266a-b359-4c50-aa46-f7a2242ac0af','ครู','informant-reports',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('89aa9829-88bd-4a03-8f69-6fc414be6044','ผู้ดูแลระบบ','behavior-records',1,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('8c185423-052e-4b52-a1a6-6d039d4e1e5a','นักเรียน','attendance',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('8c764502-0831-42dc-9785-e7d25ce59d05','ครู','dashboard',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('8ee2de8f-956f-43df-b112-6333cf91c67e','ผู้ปกครอง','behavior-records',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('95249bf0-0c83-481f-8812-f7166a056805','ผู้ดูแลระบบ','risk-students',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('95a2b51c-5118-4f38-af38-303639161944','ผู้ปกครอง','messages',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('9c0fe28c-b439-4928-bb56-8bc2519ab2ab','นักเรียน','risk-students',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('9c5eb367-b41d-4e0b-aaf1-fb9e59d7c2ca','ครู','attendance',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('a1217f6e-8929-4299-bff6-38456256ead4','ผู้ปกครอง','behavior-rules',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('a324226c-02f1-402b-b421-e426aa3424c5','ผู้ปกครอง','attendance',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('a8dbb410-6cee-43e0-9d54-3edea4fe35e3','นักเรียน','appeals',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('aa89c07b-b163-4fb0-83c8-ee9aa2a0c2b5','ผู้ปกครอง','appeals',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('b2464701-c440-4ef4-8084-96089320641e','ผู้ดูแลระบบ','permissions',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('b57ba662-8100-4928-b208-f1de29a6fcb2','ครู','appeals',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('bae10289-e7a7-48a6-90fc-b9dd01322377','ผู้ดูแลระบบ','informant-reports',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('bc67e84c-56d8-4dd9-9a46-bbc83eeab7c9','ฝ่ายปกครอง','users',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('bd4cefbb-117c-4cdb-8922-6726c59967ed','ฝ่ายปกครอง','attendance',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('c77a91ce-4d46-49fd-a9c9-1b596b5fd902','ฝ่ายปกครอง','risk-students',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('cca995f3-f8d0-4cfc-8e38-804011f99006','นักเรียน','permissions',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('d2786506-5c80-4f4f-a449-02b899b0d210','นักเรียน','behavior-records',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('d7b557b8-a1a3-4010-9ebd-612e66ef8c0d','ฝ่ายปกครอง','behavior-records',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('dcbafac8-0e22-404a-aacb-7ebc43e98667','ผู้ดูแลระบบ','users',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('e1663136-dbe9-4535-bf88-d71ced7062d1','นักเรียน','informant-reports',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('e494313b-6fbb-4c6f-8af9-5038eba58dc6','ฝ่ายปกครอง','informant-reports',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('e7b2cfa5-b350-47e2-8bdf-10bdf1bf2755','นักเรียน','dashboard',1,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('e7e7694f-a6d2-419f-9aec-6a8b903f1150','ผู้ดูแลระบบ','appeals',1,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('e9e02dca-3bc0-45bd-b25c-7e32dfc03025','ครู','risk-students',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('ea951fcc-3a0e-4438-887d-5da0ed698725','ครู','permissions',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('f76223b9-ab50-430d-9f5f-ef633d9052ed','ผู้ปกครอง','users',0,'2026-07-05 08:48:44','2026-07-05 08:48:44'),('fc976288-06c0-434a-a71d-d7cdbefa19d0','ครู','users',0,'2026-07-05 08:48:44','2026-07-05 08:48:44');
/*!40000 ALTER TABLE `role_permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sessions`
--

DROP TABLE IF EXISTS `sessions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `sessions` (
  `id` varchar(255) NOT NULL,
  `user_id` bigint(20) unsigned DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `user_agent` text DEFAULT NULL,
  `payload` longtext NOT NULL,
  `last_activity` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `sessions_user_id_index` (`user_id`),
  KEY `sessions_last_activity_index` (`last_activity`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sessions`
--

LOCK TABLES `sessions` WRITE;
/*!40000 ALTER TABLE `sessions` DISABLE KEYS */;
/*!40000 ALTER TABLE `sessions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `students`
--

DROP TABLE IF EXISTS `students`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `students` (
  `StudentID` varchar(10) NOT NULL,
  `UserID` varchar(36) NOT NULL,
  `ParentID` varchar(36) DEFAULT NULL,
  `FirstName` varchar(50) NOT NULL,
  `LastName` varchar(50) NOT NULL,
  `Gender` varchar(10) DEFAULT NULL,
  `Photo` varchar(255) DEFAULT NULL,
  `GradeLevel` varchar(10) DEFAULT NULL,
  `Classroom` varchar(10) DEFAULT NULL,
  `BehaviorScore` int(11) NOT NULL DEFAULT 100,
  `RiskStatus` varchar(50) NOT NULL DEFAULT 'ปกติ',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`StudentID`),
  KEY `students_userid_foreign` (`UserID`),
  KEY `students_parentid_foreign` (`ParentID`),
  CONSTRAINT `students_parentid_foreign` FOREIGN KEY (`ParentID`) REFERENCES `parents` (`ParentID`) ON DELETE SET NULL,
  CONSTRAINT `students_userid_foreign` FOREIGN KEY (`UserID`) REFERENCES `users` (`UserID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `students`
--

LOCK TABLES `students` WRITE;
/*!40000 ALTER TABLE `students` DISABLE KEYS */;
INSERT INTO `students` VALUES ('10001','stud-uuid-1','parent-uuid-1','ด.ช. เก่ง','เรียนดี',NULL,'photos/10001.png','ม.1','ม.1/1',100,'ปกติ','2026-07-05 08:48:41','2026-07-05 08:48:41'),('10002','stud-uuid-2','parent-uuid-2','ด.ญ. กานดา','รักดี',NULL,'photos/10002.png','ม.1','ม.1/1',95,'ปกติ','2026-07-05 08:48:42','2026-07-05 08:48:42'),('10003','stud-uuid-3','parent-uuid-3','ด.ช. ขยัน','พากเพียร',NULL,'photos/10003.png','ม.1','ม.1/2',85,'ปกติ','2026-07-05 08:48:42','2026-07-05 08:48:42'),('10004','stud-uuid-4','parent-uuid-4','ด.ช. เด็กดื้อ','ดนตรี',NULL,'photos/10004.png','ม.1','ม.1/1',55,'วิกฤต','2026-07-05 08:48:42','2026-07-05 08:48:42'),('10005','stud-uuid-5','parent-uuid-5','ด.ญ. สมใจ','ยินดี',NULL,'photos/10005.png','ม.2','ม.2/1',75,'เฝ้าระวัง','2026-07-05 08:48:43','2026-07-05 08:48:43'),('10006','stud-uuid-6','parent-uuid-6','ด.ช. ปัญญา','เลิศล้ำ',NULL,'photos/10006.png','ม.3','ม.3/1',100,'ปกติ','2026-07-05 08:48:43','2026-07-05 08:48:43');
/*!40000 ALTER TABLE `students` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `teachers`
--

DROP TABLE IF EXISTS `teachers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `teachers` (
  `TeacherID` varchar(36) NOT NULL,
  `UserID` varchar(36) NOT NULL,
  `Department` varchar(100) DEFAULT NULL,
  `AdvisoryRoom` varchar(10) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`TeacherID`),
  KEY `teachers_userid_foreign` (`UserID`),
  CONSTRAINT `teachers_userid_foreign` FOREIGN KEY (`UserID`) REFERENCES `users` (`UserID`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teachers`
--

LOCK TABLES `teachers` WRITE;
/*!40000 ALTER TABLE `teachers` DISABLE KEYS */;
INSERT INTO `teachers` VALUES ('tch001','a25ab45b-fbbf-43a8-85e4-eb726948b5c2','คณิตศาสตร์','ม.1/1','2026-07-05 08:48:40','2026-07-05 08:48:40'),('tch002','8408a9cb-681e-4590-abce-a60b0c813a3c','วิทยาศาสตร์','ม.2/1','2026-07-05 08:48:40','2026-07-05 08:48:40'),('tch003','ac45cb76-028a-458c-9d31-2f4020c72a6e','ภาษาไทย','ม.3/1','2026-07-05 08:48:41','2026-07-05 08:48:41'),('tch004','8bfc3c96-41d9-4a8a-a105-ee6badbcda68','สังคมศึกษา','ม.4/1','2026-07-05 08:48:41','2026-07-05 08:48:41'),('tch005','b758f5e9-d5e5-44c1-a2f2-dfac085e4f7f','ภาษาอังกฤษ','ม.5/1','2026-07-05 08:48:41','2026-07-05 08:48:41');
/*!40000 ALTER TABLE `teachers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `UserID` varchar(36) NOT NULL,
  `Username` varchar(50) NOT NULL,
  `Password` varchar(255) NOT NULL,
  `FirstName` varchar(50) NOT NULL,
  `LastName` varchar(50) NOT NULL,
  `Role` varchar(50) NOT NULL,
  `Email` varchar(100) DEFAULT NULL,
  `Phone` varchar(20) DEFAULT NULL,
  `Status` varchar(50) NOT NULL DEFAULT 'ปกติ',
  `AdditionalInfo` varchar(255) DEFAULT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`UserID`),
  UNIQUE KEY `users_username_unique` (`Username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES ('1d4daca7-56f6-423d-8615-b0271aa20b7c','dsp001','$2y$12$SzZjVL.SPPlYOsUN27uSJOy/g1.kYQZhn845i6T5.UlQWYdLdEJcy','นายอับดุลเลาะ','มะแอ','ฝ่ายปกครอง','discipline01@example.com','0876543210','ปกติ',NULL,NULL,'2026-07-05 08:48:40','2026-07-05 08:48:40'),('4c77b572-e923-4ad5-a75a-d11302d5d642','adm001','$2y$12$VM13ikPTPhtSyLMZ4hPNsOSCb7apn6zqYNcmLhpiVl2l0DwgWAd.K','นายสมชาย','ใจดี','ผู้ดูแลระบบ','admin@example.com','0800000000','ปกติ',NULL,NULL,'2026-07-05 08:48:40','2026-07-05 08:48:40'),('72df7ac0-b2a5-4da6-873e-d8bf87532892','dsp002','$2y$12$dCz6sjkzRPFqW2Sgru/X6utlL4KpcJv7wQtlGF34/QOwwPOK1svk6','นางสาวฟาติมะห์','ดอเลาะ','ฝ่ายปกครอง','discipline02@example.com','0876543211','ปกติ',NULL,NULL,'2026-07-05 08:48:40','2026-07-05 08:48:40'),('8408a9cb-681e-4590-abce-a60b0c813a3c','tch002','$2y$12$zNGzxMcz6dgecR8wOGcaT.nyyyEYnZ22qLugdRQV.fkAKNLEyZZNq','นายซูไฮมี','มะเซ็ง','ครู','tch002@example.com','0898765432','ปกติ',NULL,NULL,'2026-07-05 08:48:40','2026-07-05 08:48:40'),('8bfc3c96-41d9-4a8a-a105-ee6badbcda68','tch004','$2y$12$L/rz/IvfxDRlBplub7QIEO/S/FZcuR2jSMCcx/y4MjgoNYYGCFcl.','นายอาดิล','แวดอเลาะ','ครู','tch004@example.com','0898765432','ปกติ',NULL,NULL,'2026-07-05 08:48:41','2026-07-05 08:48:41'),('a25ab45b-fbbf-43a8-85e4-eb726948b5c2','tch001','$2y$12$Nm1uBPSjTJaS6Ww/f/cF1.yEl7HOgOb2tzn7150tIapBMUSDK2Nwe','นางสาวนูรีดา','สาและ','ครู','tch001@example.com','0898765432','ปกติ',NULL,NULL,'2026-07-05 08:48:40','2026-07-05 08:48:40'),('ac45cb76-028a-458c-9d31-2f4020c72a6e','tch003','$2y$12$0IMowVF07FDb03PPzA9PVuHDSaXbCWq22rQMIvIpw069ZojUGyMqu','นางรอฮานี','ยามา','ครู','tch003@example.com','0898765432','ปกติ',NULL,NULL,'2026-07-05 08:48:41','2026-07-05 08:48:41'),('b758f5e9-d5e5-44c1-a2f2-dfac085e4f7f','tch005','$2y$12$wIN6mq0yVj2vUjIGiHC9YOvYIpPrGhFVGSCMWeLDl8wJ35DH4si5K','นางสาวซาฟีนะห์','กาเซ็ง','ครู','tch005@example.com','0898765432','ปกติ',NULL,NULL,'2026-07-05 08:48:41','2026-07-05 08:48:41'),('parent-uuid-1','prt10001','$2y$12$vazwgAtAUnKo.XybAh7jjeUDBGXMfNE05SL.oHBrJlcpX8bk83aci','นายสมคิด','เรียนดี','ผู้ปกครอง','prt10001@example.com','0812345678','ปกติ',NULL,NULL,'2026-07-05 08:48:41','2026-07-05 08:48:41'),('parent-uuid-2','prt10002','$2y$12$4IbWqe.AAAMvIQzi/Ctbguor1q7NCWtPUdziehMGw69Hnrm9.pWry','นางกัลยา','รักดี','ผู้ปกครอง','prt10002@example.com','0812345678','ปกติ',NULL,NULL,'2026-07-05 08:48:42','2026-07-05 08:48:42'),('parent-uuid-3','prt10003','$2y$12$unWEX4AkUdn./reyZkfqj.QT.6CDFMWu9.FEcWxQd0Q2DiMWyIeRa','นายขจร','พากเพียร','ผู้ปกครอง','prt10003@example.com','0812345678','ปกติ',NULL,NULL,'2026-07-05 08:48:42','2026-07-05 08:48:42'),('parent-uuid-4','prt10004','$2y$12$kdrOXQgf6jjsg.60kc3soua0k0Iv5ddgFNREukzpW0kiAUYEJrRUS','นายดนัย','ดนตรี','ผู้ปกครอง','prt10004@example.com','0812345678','ปกติ',NULL,NULL,'2026-07-05 08:48:42','2026-07-05 08:48:42'),('parent-uuid-5','prt10005','$2y$12$PLoU.NxZFx0pXft6pFptS.XwmDbdZO/MY8isbuKTgiZUY8mJt78XK','นางสมศรี','ยินดี','ผู้ปกครอง','prt10005@example.com','0812345678','ปกติ',NULL,NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('parent-uuid-6','prt10006','$2y$12$ZQFBccAdWXgfcn89N.9mGuxbm1boyMdRFPLXJnLIsWHhw7Wc0KQni','นายประสงค์','เลิศล้ำ','ผู้ปกครอง','prt10006@example.com','0812345678','ปกติ',NULL,NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('stud-uuid-1','std10001','$2y$12$JZ/Gv1AxydwCFzqHoMEDhOpVbApuIyosubpa8ZM9kRrcvjVuIGRGu','ด.ช. เก่ง','เรียนดี','นักเรียน','std10001@example.com','0823456789','ปกติ',NULL,NULL,'2026-07-05 08:48:41','2026-07-05 08:48:41'),('stud-uuid-2','std10002','$2y$12$L.drQWI6L2VZPFnEmMLIW.PkCwF9MUpjFdqVPY8882ygClQg4.68W','ด.ญ. กานดา','รักดี','นักเรียน','std10002@example.com','0823456789','ปกติ',NULL,NULL,'2026-07-05 08:48:42','2026-07-05 08:48:42'),('stud-uuid-3','std10003','$2y$12$bQwH2WS9N/Rn1HytTAb3pOplIuWQ4ovu5dG..9y5.PYBPhu2b/nYW','ด.ช. ขยัน','พากเพียร','นักเรียน','std10003@example.com','0823456789','ปกติ',NULL,NULL,'2026-07-05 08:48:42','2026-07-05 08:48:42'),('stud-uuid-4','std10004','$2y$12$WnaBsdGu0hS/Bpebl2qk9u9MGa8Qgk7iBTQgnfagTO9UV1A/USpMG','ด.ช. เด็กดื้อ','ดนตรี','นักเรียน','std10004@example.com','0823456789','ปกติ',NULL,NULL,'2026-07-05 08:48:42','2026-07-05 08:48:42'),('stud-uuid-5','std10005','$2y$12$gvH2YSdTMJ8AozuYNkEs7e7U7Q1d2eU4zpSklmXFZMl/h6ryIu3/y','ด.ญ. สมใจ','ยินดี','นักเรียน','std10005@example.com','0823456789','ปกติ',NULL,NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43'),('stud-uuid-6','std10006','$2y$12$hFlDZYpgsACZ7bNonAVOT.mv/ab2kv6CHrwLZEnmLILBG2tc1IinW','ด.ช. ปัญญา','เลิศล้ำ','นักเรียน','std10006@example.com','0823456789','ปกติ',NULL,NULL,'2026-07-05 08:48:43','2026-07-05 08:48:43');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-07-05 22:49:01
